{
    "projects": [
        {
            "title": "System for Envisioning Environment",
            "type": "Capstone Project",
            "description": "System for Envisioning Environment (SEE) is a ...",
            "image": "..."
        },
        {
            "title": "March Madness Predictor",
            "type": "Class/Personal Project",
            "description": "Developed a March Madness bracket predictor using Python using data from a Kaggle competition dataset. ...",
            "image": "assets/proj/march-madness.jpg",
            "kaggle": "..."
        },
        {
            "title": "This Website",
            "type": "Personal Project",
            "description": "Using some experience in Typescript and React, I built this website to showcase my projects and experience. The website is hosted on Render.io, and the source code is available on GitHub. A previous version of the website was built using HTML and CSS.",
            "image": "",
            "github": "https://github.com/Waikebber/Website"
        },
        {
            "title": "Robotic Arm",
            "type": "Class Project",
            "description": "For my Embedded Design class at Northeastern University, I developed a robotic arm using pulse width modulation (PWM) to control its movements. The goal was to program the arm to pick up a bottle from various positions and move it with precision.",
            "image": "assets/proj/arm-class.jpg",
            "github": "https://github.com/Waikebber/PWM-Robotic-Arm"
        },
        {
            "title": "NU Electric Racing Club",
            "type": "Telemetry Team",
            "description": "Contributed to the telemetry team using telemetry-XBee for real-time data transfer and InfluxDB Flux for data visualization. Helped monitor car components in a high-performance engineering environment.",
            "image": "assets/proj/electric_car.jpg"
        },
        {
            "title": "NEU SEDS, Rover Team",
            "type": "Autonomous Navigation Team Member",
            "description": "Worked on rover localization systems to enable autonomous navigation. Gained hands-on experience in robotics and space exploration.",
            "image": "assets/proj/rover.jpg"
        },
        {
            "title": "UNET Image Classifier",
            "type": "Personal Project",
            "description": "Created a pipeline for scraping and segmenting images using a U-Net model. Labeled data with the LabelBox API and trained on bird species datasets with high accuracy.",
            "image": "assets/proj/unet.png",
            "github": "https://github.com/Waikebber/Bird_Classifier"
        }
    ]
  }